Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/transition_year.html.txt.tmx
Source language: en
Languages: ga

source: Transition Year (TY) is a one-year school-based programme between Junior Cycle and Senior Cycle
ga: Is clár bliana idir an tsraith shóisearach agus an tsraith shinsearach í an Bhliain Idirmheánach, atá bunaithe sa scoil

source: It is designed to act as a bridge between the two by facilitating the smooth transition from the more dependent learning of the Junior Cycle to the more independent self-directed learning required for the Senior Cycle
ga: Dearadh í mar dhroichead idir an dá tsraith chun an t-athrú ó fhoghlaim spleách na sraithe Sóisearaí go dtí foghlaim neamhspleách, féin-stiúrtha na sraithe Sinsirigh

source: All second-level schools have the option of offering the Transition Year programme to their students and most of them do offer it
ga: Tá an rogha ag gach scoil an bhliain idirmheánach a chur ar fáil ina scoil féin, agus cuireann formhór na scoileanna ar fáil í

source: The Transition Year programme follows the Junior Cycle and is generally seen as the first year of a three-year Senior Cycle programme
ga: Leanann clár na hIdirbhliana an tSraith Shóisearach agus caitear leis, go ginearálta, mar an chéad bhliain de chlár Sraithe Sinsearaí trí bliana

source: However, Transition Year is not in fact the first year of the Leaving Certificate programme, which is a two-year cycle
ga: Ní an chéad bhliain den Árd-Teistiméireacht í. Is tréimhse dhá bhliain an Árd-Teistiméireacht

source: Aims of the Transition Year programme
ga: Aidhm na Bliana Idirmheánaigh

source: The Transition Year offers students an opportunity:
ga: Tugann an Bhliain Idirmheánach deis do scoláirí:

source: • To engage in independent, self-directed learning,
ga: • Tabhairt faoi fhoghlaim neamhspleách, féin-stiúrtha

source: • To develop general, technical and academic skills
ga: • Scileanna ginearálta, scileanna teicniúla agus scileanna acadúla a fhorbairt

source: • To mature and develop without the pressure of an examination
ga: • Forbairt agus fás gan brú scrúdaithe

source: You can read the Transition Year programmes: guidelines for schools on the website of the Department of Education and Skills
ga: Cuireann an Roinn Oideachais agus Scileanna treoirlínte do scoileanna ar fáíl

source: Areas of study in Transition Year
ga: Réimse ábhar léinn na Bliana Idirmheánaí

source: Areas of study may include:
ga: I measc na limistéar staidéir, d’fhéadfaí an méid a leanas a chuimsiú:

source: You can find more information about the TY curriculum on the PDST website
ga: Is féidir leat teacht ar thuilleadh faisnéise faoi churaclam na hIdirbhliana ar láithreán gréasáin an PDST

source: Teachers have the chance to design programmes and courses tailored to the needs and interests of students
ga: Tá deis ag múinteoirí clár a leagan amach atá dírithe ar riachtanais agus suim na scoláirí

source: Parents, the community and local enterprise can bring new kinds of learning opportunities to the students
ga: Is féidir le tuismitheoirí, leis an bpobal áitiúl agus le fiontair áitiúl deis foghlamtha nua a chuir os comhair na scoláirí

source: Students get the opportunity to sample a wide range of subject areas and can make more informed choices about the kind of Leaving Certificate programme they want to follow after the Transition Year. Transition Year is optional and admission criteria vary from school to school
ga: Tugtar deis do scoláirí rogha leathan ábhar a dhéanamh rud a chuireann ar a gcumas na hábhair a phiocadh don Ard Teist, ó bhunús eolais seachas iad a phiocadh gan fáth, nuair a bhíonn an bhliain idirmheánach críochnaithe

source: Parental involvement in the Transition Year
ga: Páirt na dtuismitheoirí sa Bhliain Idirmheánach

source: When drawing up the Transition Year programme, schools are encouraged to involve parents in the decision-making process and in the planning. To assist in the decision-making process, most schools arrange sessions for parents of third-year students to discuss the Transition Year programme, while a specifically designed 'Student Introduction to Transition Year' seminar can be run for the Junior Cycle students themselves
ga: Ba chóir go mbeadh tuairim na dtuismitheoirí faighte sula leagtar síos clár don bhliain idirmheánach.Chun cabhrú leis an bpróiseas déanta cinntí, socraíonn formhór na scoileanna seisiúin do thuismitheoirí daltaí tríú bliana chun plé a dhéanamh ar chlár na hIdirbhliana, agus is féidir seimineár saindeartha ‘Réamheolas do Dhaltaí ar an Idirbhliain’ a reáchtáil do dhaltaí na Sraithe Sóisearaí iad féin

source: Some parents make their expertise available to the school during the Transition Year as visiting speakers, others may assist in the Work Experience Programme while all parents are invited to contribute to the evaluation of the programme
ga: Cuireann tuismitheoirí áirithe a gcuid saineolais ar fáil don scoil le linn na bliana idirmheánaí mar aoichainteoirí, nó cuidíonn siad leis an gClár um Thaithí Oibre

source: You can find further information in this list of frequently asked questions on the Transition Year Programme
ga: Tugtar cuireadh do na tuismitheoirí ar fad cuidiú le hathbhreithniú a dhéanamh ar an gclár ag deireadh na bliana

source: There is no end-of-year state examination in the Transition Year - a decision made by the Department of Education and Skills to ensure that the focus of the year was learning-led rather than exam-driven
ga: Níl aon scrúdú stáit ag baint leis an mbliain idirmheánach – cinneadh a thóg an Roinn Oideachais agus Scileanna chun a bheith cinnte go ndíreodh an bhliain ar fhoghlaim seachas scrúduithe

source: The activity-based learning ethos of the year requires each school to engage in school-based assessment, which helps students to identify their own strengths and weaknesses, as well as develop the skills of self-assessment and reflection
ga: Mar gheall ar éiteas foghlama gníomhach na bliana bíonn ar gach scoil measúnú scoile a dhéanamh, rud a léiríonn do na scoláirí cá bhfuil a laigeachtaí agus a nirt

source: Assessment is ongoing, with portfolio assessment, project work, and exhibitions of students' work
ga: Chomh maith leis sin, forbraíonn siad scileanna féinmheasúnaithe agus machnaimh

source: Oral aural, practical and written activities all form part of this assessment process
ga: Is rud leanúnach é an measúnú seo agus bíonn obair thionscnaimh, cáipéisí agus taispeántais ar obair na scoláirí mar chuid den phroiséis measúnaithe, chomh maith le gníomhaíochtaí labhartha, éisteachta agus scríofa

source: Since 2000, the Department has issued an official Transition Year Certificate to participants in addition to schools providing their own school-based certification
ga: Eisíonn an Roinn Oideachais agus Scileanna Teastas oifigiúil do rannpháirtithe sa Bhliain Idirmheánach chomh maith leis an teastas a bhronnann an scoil í féin
